tests/fixtures/mod_cart.xml

<?xml version="1.0" encoding="UTF-8" ?>
<dataset>
    <admin_group id="1" name="Administrators" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <admin id="1" role="admin" admin_group_id="1" email="admin@boxbilling.com" pass="89e495e7941cf9e40e6980d14a16bf023ccd4c91" status="active" name="Admin" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <client id="1" aid="1" role="client" email="client@boxbilling.com" pass="89e495e7941cf9e40e6980d14a16bf023ccd4c91" status="active" first_name="Demo" last_name="Client" phone_cc="1" phone="646-123-4567" company="BoxBilling" address_1="Wall Street 45" city="New York" country="US" currency="USD" postcode="123456" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <client_balance />

    <service_hosting_hp id="1" name="Golden" />
    <service_hosting_server id="1" name="Server PHPUnit" ip="144.144.144.144" manager="Custom" ns1="ns1.1fh.com"  ns2="ns2.1fh.com"  ns3="ns3.1fh.com"  ns4="ns4.1fh.com"/>
    
    <service_custom id="1" client_id="1" plugin="Example" />

    <promo id="1" code="PHPUNIT" description="Desc" type="absolute" value="1" once_per_client="0" freesetup="0" active="1" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <promo id="2" code="FREE_SETUP" description="Free setup" type="absolute" value="0" once_per_client="0" freesetup="1" active="1" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <promo id="3" code="ONCE_PER_CLIENT" description="Once per client promo" type="percentage" value="100" once_per_client="1" recurring="1" freesetup="1" active="1" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <promo id="4" code="RECURRING" description="recurring promo code" type="percentage" value="50" once_per_client="1" recurring="1" active="1" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <promo id="5" code="TOTAL_DISCOUNT" description="100% discount" type="percentage" value="100" once_per_client="0" recurring="0" active="1" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <product_category id="1" title="All products" description="Desc" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <product_payment id="1" type="once" once_price="10" w_enabled="1"/>
    <product_payment id="2" type="once" once_price="10" w_enabled="1"/>
    <product_payment id="3" type="free" once_price="0" w_enabled="1"/>
    <product_payment id="4" type="once" once_price="10" w_enabled="1"/>
    <product_payment id="5" type="recurrent" once_price="0" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150" w_enabled="0"/>
    <product_payment id="6" type="recurrent" once_price="0" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150" w_enabled="1"/>
    <product_payment id="7" type="once" once_price="10" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150"  w_enabled="1"/>
    <product_payment id="8" type="recurrent" once_price="0" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150"  w_enabled="1"/>
    <product_payment id="9" type="recurrent" once_price="0" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150"  w_enabled="1"/>
    <product_payment id="10" type="recurrent" once_price="0" m_price="30" q_price="20" b_price="10" a_price="5" bia_price="50" tria_price="150"  w_enabled="1"/>
    <product_payment id="11" type="once" once_price="50" once_setup_price="20"  w_enabled="1"/>
    <product_payment id="12" type="recurrent" once_price="0" once_setup_price="0" m_price="30" q_price="90" b_price="180" a_price="360" bia_price="720" tria_price="1440" w_enabled="1"/>
    <product_payment id="13" type="recurrent" once_price="0" once_setup_price="0" m_price="30" q_price="90" b_price="180" a_price="360" bia_price="720" tria_price="1440" w_enabled="0"/>

    <product id="1" product_category_id="1" product_payment_id="1" type="custom" title="SSL Certificate" description="SSL cetificate information" unit="product" active="1" is_addon="0" addons="[3,4,5]" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="2" product_category_id="1" product_payment_id="2" type="custom" title="Custom product with plugin" description="Custom product with plugin" unit="product" active="1" is_addon="0" addons="[3,4,5]" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <product id="3" product_category_id="1" product_payment_id="3" type="custom" title="Free Addon" description="Sold only as an addon" unit="product" active="1" is_addon="1" addons="" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="4" product_category_id="1" product_payment_id="4" type="custom" title="One time payment Addon" description="Sold only as an addon" unit="product" active="1" is_addon="1" addons="" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="5" product_category_id="1" product_payment_id="5" type="custom" title="Recurrent payment addon" description="pp" unit="product" active="1" is_addon="1" addons="" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <product id="6" product_category_id="1" product_payment_id="6" type="license" title="License" description="" unit="license" active="1" is_addon="0" addons="[3,4,5]" config='{"prefix":"BOX-FREE-", "length":25, "validate_ip":1}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="7" product_category_id="1" product_payment_id="7" type="downloadable" title="Software" description="" unit="product" active="1" is_addon="0" addons="[3,4,5]" config='{"filename":"test.txt"}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="8" product_category_id="1" product_payment_id="8" type="hosting" title="Shared hosting" description="" unit="month" active="1" is_addon="0" addons="[3,4,5]" config='{"server_id":"1", "hosting_plan_id":"1"}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="9" product_category_id="1" product_payment_id="9" type="hosting" title="Reseller hosting" description="" unit="month" active="1" is_addon="0" addons="[3,4,5]" config='{"server_id":"1", "hosting_plan_id":"1"}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="10" product_category_id="1" type="domain" title="All domains" description="" unit="month" active="1" is_addon="0" addons="[3,4,5]" config='{"all_tlds":1}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="11" product_category_id="1" product_payment_id="8" type="hosting" title="Shared hosting with free domain" description="" unit="month" active="1" is_addon="0" addons="" config='{"server_id":"1", "hosting_plan_id":"1", "free_domain":"1", "free_transfer":"1","free_tlds":[".com"],"free_domain_periods":["1M","3M","6M","1Y","2Y"]}' setup="after_payment" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="12" product_category_id="1" product_payment_id="10" type="membership" title="PVA Membership" description="" unit="month" active="1" is_addon="0" addons="" config='' setup="after_payment" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="13" product_category_id="1" product_payment_id="11" type="custom" title="Product with setup price" description="Product with setup price" unit="product" active="1" is_addon="0" addons="" setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="15" product_category_id="1" product_payment_id="12" type="solusvm" title="SolusVM product" description="VPS Product" unit="product" active="1" is_addon="0" addons="" config='{"node":"1", "plan":"Small", "vtype":"openvz", "ips":"1"}' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="16" product_category_id="1" product_payment_id="12" type="boxbillinglicense" title="BoxBilling license" description="BoxBilling License product" unit="product" active="1" is_addon="0" addons="" config='' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>
    <product id="17" product_category_id="1" product_payment_id="13" type="boxbillinglicense" title="BoxBilling license" description="BoxBilling License product" unit="product" active="1" is_addon="0" addons="" config='' setup="after_payment" plugin="" created_at="2011-01-01 12:00:00" updated_at="2011-01-01 12:00:00"/>

    <client_order id="1" client_id="1" group_id="100" group_master="1" product_id="1" currency="USD" service_type="custom" period="" quantity="1" price="10" status="pending_setup" notes="" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="2" client_id="1" group_id="100" product_id="2" currency="USD" service_type="custom" period="" quantity="1" price="10" status="pending_setup" notes="" config='{"plugin":"Example"}' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>

    <client_order id="3" client_id="1" group_id="300" product_id="6" currency="USD" service_type="license" period="1M" quantity="1" price="30" status="pending_setup" notes="" config='{"plugin":"Simple", "prefix":"PRO-"}' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="4" client_id="1" group_id="300" product_id="7" currency="USD" service_type="downloadable" period="" quantity="1" price="30" status="pending_setup" notes="" config='{"filename":"test.txt"}' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="5" client_id="1" group_id="300" product_id="8" currency="USD" service_type="hosting" period="3M" quantity="1" price="30" status="pending_setup" notes="" config='{"server_id":"1", "hosting_plan_id":"1", "sld":"mysuperdomain","tld":".com"}' created_at="2011-10-25 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="6" client_id="1" group_id="300" product_id="9" currency="USD" service_type="hosting" period="3M" quantity="1" price="30" status="pending_setup" notes="" config='{"server_id":"1", "hosting_plan_id":"1", "sld":"myresellerdomain","tld":".com"}' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="7" client_id="1" group_id="300" product_id="10" currency="USD" service_type="domain" period="2Y" quantity="1" price="30" status="pending_setup" notes="" config='{"action":"register","register_tld":".com","register_sld":"admindomain", "register_years":1}' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="9" client_id="1" group_id="300" product_id="10" currency="USD" service_type="membership" period="2Y" quantity="1" price="30" status="pending_setup" notes="" config='' created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>

    <client_order id="8" client_id="1" group_id="200" group_master="1" promo_id="3" promo_recurring="1" promo_used="1" product_id="1" currency="USD" service_type="custom" service_id="1" period="1Y" quantity="1" price="30" discount="15" status="active" notes="" config='' expires_at="2011-12-25 15:23:43" created_at="2011-11-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="10" client_id="1" group_id="300" promo_id="3" promo_recurring="0" promo_used="1" product_id="1" currency="USD" service_type="custom" period="1Y" quantity="1" price="30" discount="15" status="active" notes="" config='' expires_at="2011-12-25 15:23:43" created_at="2011-11-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="12" client_id="1" group_id="300" promo_recurring="0" promo_used="0" product_id="15" currency="USD" service_type="solusvm" period="3M" quantity="1" price="30" discount="0" status="pending_setup" notes="" config='{"server_id":"1", "plan":"Small", "hostname":"vpsdomain.com", "template":"centos-6-x86"}' expires_at="2011-12-25 15:23:43" created_at="2011-11-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <client_order id="13" client_id="1" group_id="300" service_type="boxbillinglicense" service_id="1" status="pending_setup"/>
    
    <cart id="1" currency_id="1" created_at="2011-10-24 15:23:43"/>
    <invoice />
    <invoice_item />
    <service_custom />
    <service_domain />
    <service_license />
    <service_downloadable />
    <service_hosting />
    <service_membership />
    <client_order_status />

    <service_hosting id="1" client_id="1" service_hosting_hp_id="1" sld="exist" tld=".com" />

    <tld id="1" tld_registrar_id="1" tld=".com" allow_register="1" allow_transfer="1" price_registration="10" price_transfer="15"/>
    
    <setting id="1" param="last_cron_exec" value="2011-10-24 15:23:43" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="2" param="license" value="testing" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="3" param="db_version" value="2" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="4" param="nameserver_1" value="ns1.1freehosting.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="5" param="nameserver_2" value="ns2.1freehosting.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="6" param="nameserver_3" value="ns3.1freehosting.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="7" param="nameserver_4" value="ns4.1freehosting.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="8" param="invoice_issue_days_before_expire" value="14" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    
    <extension id="1" type="mod" name="servicesolusvm" status="installed" manifest='{ "id":  "servicesolusvm",	"type":"mod", "name":"SolusVM product", "description":  "Sell virtual servers using SolusVM extension for BoxBilling", "icon_url":  "icon.png", "homepage_url": "http://github.com/boxbilling/", "author": "BoxBilling", "author_url":"http://extensions.boxbilling.com/", "license":"http://www.boxbilling.com/license.txt", "version":"1.0.0"}'/>
    <extension id="2" type="mod" name="serviceboxbillinglicense" status="installed" manifest='{"id":"serviceboxbillinglicense",	"type":"mod","name":"BoxBilling license product","description":  "Sell BoxBiling licenses and get paid. The more you sell - more profit you make","icon_url": "icon.png","homepage_url": "http://github.com/boxbilling/","author":   "BoxBilling","author_url":   "http://extensions.boxbilling.com/","license":  "http://www.boxbilling.com/license.txt","version":  "1.0.0"}'/>
    <extension_meta id="1" extension="mod_servicesolusvm" rel_type="cluster" rel_id="1" meta_key="config" meta_value='{"id":"api_id", "key":"api_key", "ipaddress":"123.123.123.123"}'/>

    <setting id="9" param="company_email" value="boxbilling@boxbilling.com" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
    <setting id="10" param="theme" value="huraga" created_at="2011-10-24 15:23:43" updated_at="2011-10-24 15:23:43"/>
</dataset>